pragma SPARK_Mode (On);

with GlobaleVariablen, GlobaleDatentypen, DatenbankRecords, GlobaleRecords;
use GlobaleDatentypen;

package GebaeudeDatenbank is

   -- Hier noch hinschreiben welcher Wert was ist!
   LeererWertGebäudeListe : constant DatenbankRecords.GebäudeListeRecord := (' ', -- GebäudeGrafik
                                                                               0, 0, 0, 0, -- PreisGeld, PreisRessourcen, Anforderungen, PermanenteKosten
                                                                               0, 0, 0, 0, 0, -- ProduktionBonus, GeldBonus, WissenBonus, VerteidigungBonus, NahrungBonus
                                                                               False); -- Anderes

   type GebäudeListeArray is array (GlobaleDatentypen.Rassen'Range, GlobaleDatentypen.GebäudeID'Range) of DatenbankRecords.GebäudeListeRecord;
   GebäudeListe : GebäudeListeArray := (1 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1
                                                ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2
                                                ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3
                                                ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                others => LeererWertGebäudeListe),
                                                   
                                          2 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                others => LeererWertGebäudeListe),
                                                   
                                          3 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                others => LeererWertGebäudeListe),
                                                   
                                          4 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                others => LeererWertGebäudeListe),
                                                   
                                          5 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                others => LeererWertGebäudeListe),
                                                   
                                          6 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                others => LeererWertGebäudeListe),
                                                   
                                          7 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                others => LeererWertGebäudeListe),
                                                   
                                          8 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                others => LeererWertGebäudeListe),
                                                   
                                          9 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                others => LeererWertGebäudeListe),
                                                   
                                          10 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                 ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                 ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                 ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                 ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                 ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                 ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                 ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                 ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                 ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                 others => LeererWertGebäudeListe),
                                                   
                                          11 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                 ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                 ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                 ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                 ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                 ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                 ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                 ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                 ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                 ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                 others => LeererWertGebäudeListe),
                                                   
                                          12 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                 ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                 ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                 ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                 ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                 ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                 ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                 ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                 ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                 ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                 others => LeererWertGebäudeListe),
                                                   
                                          13 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                 ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                 ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                 ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                 ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                 ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                 ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                 ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                 ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                 ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                 others => LeererWertGebäudeListe),
                                                   
                                          14 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                 ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                 ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                 ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                 ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                 ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                 ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                 ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                 ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                 ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                 others => LeererWertGebäudeListe),
                                                   
                                          15 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                 ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                 ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                 ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                 ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                 ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                 ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                 ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                 ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                 ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                 others => LeererWertGebäudeListe),
                                                   
                                          16 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                 ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                 ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                 ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                 ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                 ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                 ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                 ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                 ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                 ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                 others => LeererWertGebäudeListe),
                                                   
                                          17 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                 ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                 ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                 ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                 ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                 ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                 ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                 ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                 ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                 ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                 others => LeererWertGebäudeListe),
                                                   
                                          18 => (('A',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 1 
                                                 ('B',    100, 100, 0, 0,    0, 0, 0, 0, 0,    False), -- 2 
                                                 ('C',    150, 50, 2, 0,    0, 0, 0, 0, 0,    False), -- 3 
                                                 ('D',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 4
                                                 ('E',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 5
                                                 ('F',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 6
                                                 ('G',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 7
                                                 ('H',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 8
                                                 ('I',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 9
                                                 ('J',    1000, 100, 1, 1,    0, 0, 0, 0, 0,    False), -- 10
                                                              
                                                 others => LeererWertGebäudeListe));

   type RassenAufschlagArray is array (GlobaleDatentypen.Rassen'Range) of Natural;
   RassenAufschlagForschung : constant RassenAufschlagArray := (1 => 0,
                                                                2 => 0,
                                                                3 => 0,
                                                                4 => 0,
                                                                5 => 0,
                                                                6 => 0,
                                                                7 => 0,
                                                                8 => 0,
                                                                9 => 0,
                                                                10 => 0,
                                                                11 => 0,
                                                                12 => 0,
                                                                13 => 0,
                                                                14 => 0,
                                                                15 => 0,
                                                                16 => 0,
                                                                17 => 0,
                                                                18 => 0);

   procedure Beschreibung
     (IDExtern : in GebäudeID);
   procedure GebäudeProduktionBeenden
     (StadtRasseNummerExtern : in GlobaleRecords.RassePlatznummerRecord;
      IDExtern : in GebäudeID)
     with
       Pre =>
         (StadtRasseNummerExtern.Platznummer in GlobaleVariablen.StadtGebaut'Range (2)
          and
            StadtRasseNummerExtern.Rasse in GlobaleDatentypen.Rassen
          and
            (if StadtRasseNummerExtern.Rasse > 0 then GlobaleVariablen.RassenImSpiel (StadtRasseNummerExtern.Rasse) /= 0));

end GebaeudeDatenbank;
